Cases/container/container_fvDOM/constant/airOutside/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

".*"
{
    type            lookup;
    emissivity       1.0;
    absorptivity     1.0;
    value           uniform 0.0;
}

// air
// {
//     type        transparent;

//     wallAbsorptionEmissionModel
//     {
//         type            constantAbsorption;
//         // absorptivity    (0 0);
//         // emissivity      (1 1);
//         absorptivity    0 ;
//         emissivity      1 ;
//     }
// }
// inlet
// {
//     type        transparent;

//     wallAbsorptionEmissionModel
//     {
//         type            multiBandAbsorption;
//         absorptivity    (0 0);
//         emissivity      (1 1);
//     }
// }
// outlet
// {
//     type        transparent;

//     wallAbsorptionEmissionModel
//     {
//         type            multiBandAbsorption;
//         absorptivity    (0 0);
//         emissivity      (1 1);
//     }
// }

// airOutside_to_ground
// {
//     type        opaqueReflective;

//     // Fraction of the reflected is diffussive
//     fd          0.0; // 0: all specular 1: all diffusive

//     wallAbsorptionEmissionModel
//     {
//         type            constantAbsorption;
//         // absorptivity    (0.9 0.9);
//         // emissivity      (0.9 0.9);
//         absorptivity    0.9;
//         emissivity      0.9;
//     };
// }

// trailer
// {
//     type        opaqueReflective;

//     // Fraction of the reflected is diffussive
//     fd          0.0; // 0: all specular 1: all diffusive

//     wallAbsorptionEmissionModel
//     {
//         type            multiBandAbsorption;
//         absorptivity    (0.9 0.9);
//         emissivity      (0.9 0.9);
//     };
// }

// lkw
// {
//     type        opaqueReflective;

//     // Fraction of the reflected is diffussive
//     fd          0.0; // 0: all specular 1: all diffusive

//     wallAbsorptionEmissionModel
//     {
//         type            multiBandAbsorption;
//         absorptivity    (0.9 0.9);
//         emissivity      (0.9 0.9);
//     };
// }

// airOutside_to_carrier
// {
// type        opaqueReflective;

//     // Fraction of the reflected is diffussive
//     fd          0.0; // 0: all specular 1: all diffusive

//     wallAbsorptionEmissionModel
//     {
//         type            constantAbsorption;
//         // absorptivity    (0.6 0.6);
//         // emissivity      (0.6 0.6);
//         absorptivity    0.6 ;
//         emissivity      0.6 ;
//     };
// }

// ************************************************************************* //
