Cases/container/container_fvDOM/system/airOutside/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    airOutside_to_carrier
    {
        // type        wall;
        inGroups    2(wall viewFactorWall);
    }
    airOutside_to_ground
    {
        //type        wall;
        inGroups    2(wall viewFactorWall);
    }
}

U
{
    internalField   uniform (0 0 0);

    boundaryField
    {
        air
        {
            type            noSlip;
        }
        airOutside_to_carrier
        {
            type            noSlip;
        }
        airOutside_to_ground
        {
            type            noSlip;
        }
    }
}

T
{
    internalField   uniform 285;


    boundaryField
    {
        airOutside_to_carrier
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            qrNbr           none;
            qr              qr;
            // thicknessLayers (0.002);
            // kappaLayers     (40);
            kappa           none;
            thermalInertia  true;
            value           $internalField;
        }
        air
        {
            type    fixedValue;
            value   $internalField;
            // type            uniformFixedValue;
            // // value           $internalField;
            // // inletValue      $internalField;
            // uniformValue   table 
            // (
            //     (0      285)
            //     (3600   284)
            //     (7200   283)
            //     (10800  282)
            //     (14400  281)
            //     (18000  280)
            //     (21600  281)
            //     (25200  283)
            //     (28800  284)
            //     (32400  285)
            //     (36000  287)
            //     (39600  289)
            //     (44200  291)
            //     (47800  294)
            //     (51400  297)
            //     (54000  296)
            //     (57600  292)
            //     (61200  289)
            //     (63800  287)
            //     (68400  286)
            //     (72000  286)
            //     (75600  286)
            //     (79200  286)
            //     (82800  286)
            // );
        }
        airOutside_to_ground
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            qrNbr           none;
            qr              qr;
            kappa           none;
            thermalInertia  true;
            value           $internalField;
        }
    }
}

p_rgh
{
    internalField   uniform 1e5;

    boundaryField
    {
        air
        {
            type            fixedFluxPressure;
            value           $internalField;
        }
        // air
        // {
        //     type            totalPressure;
        //     p0              $internalField;
        //     value           $internalField;
        // }
        // symmetryPlanes
        // {
		// 	type            symmetry;
        // }
        // airOutside_to_batterie0
        // {
        //     type    fixedFluxPressure;
        //     value   $internalField;
        // }
        airOutside_to_carrier
        {
            type    fixedFluxPressure;
            value   $internalField;
        }
        airOutside_to_ground
        {
            type    fixedFluxPressure;
            value   $internalField;
        }
    }
}

p
{
    internalField   uniform 1e5;

    boundaryField
    {
        // symmetryPlanes
        // {
		// 	type            symmetry;
        // }
        ".*"
        {
            type            calculated;
            value           $internalField;
        }
    }
}

// ************************************************************************* //
